define([], function () {
    var constant = {
        /**
         * 品种
         */
        breedType: [
            "史宾格犬",
            "罗威纳犬",
            "拉拉多犬",
            "德国牧羊犬",
            "荷兰牧羊犬",
            "昆明犬",
            "马里努阿犬",
            "金毛犬",
            "杜宾犬（杜博文）",
            "杂交犬",
            "其他"
        ],
        /**
         * 毛色
         */
        dogColor: [
            '黑',
            '黄',
            '棕',
            '黑背黄腹',
            '浅黄',
            '棕黄',
            '黑白',
            '棕白',
            '豹纹',
            '狼青',
            '枯草黄',
            '其他'
        ],
        /**
         * 毛型
         */
        hairType: [
            "短毛",
            "长毛",
            "中长毛",
            "其他"
        ],
        /**
         * 来源
         */
        dog_source: [
            "自繁",
            "南京片区",
            "沈阳片区",
            "昆明片区",
            "南昌片区",
            "民间",
            "部队",
            "国外",
            "动检系统",
            "其他"
        ]
    };
    return constant;
});